import React from 'react';
import { Container, Row, Col, Card, CardBody, CardHeader } from 'shards-react';
import { withTranslation } from 'react-i18next';

class Post extends React.PureComponent {
  componentDidUpdate() {
    window.scrollTo(0, 0);
  }

  render() {
    return (
      <Container
        fluid
        className="main-content-container px-4 pb-4 thisisssssss">
        <Row noGutters className="page-header py-4"></Row>

        <Row>
          <Col lg="12" md="12">
            <Row>
              <Col lg="12" md="12">
                <Card small className="mb-3">
                  <CardHeader>
                    <h1 className="kjhghjk">
                      <div
                        className="d-inline-block item-icon-wrapper ytrerty"
                        dangerouslySetInnerHTML={{
                          __html: 'توافق نامه کاربری',
                        }}
                      />
                    </h1>
                  </CardHeader>
                  <CardBody>
                    <div
                      className="d-inline-block item-icon-wrapper ytrerty"
                      dangerouslySetInnerHTML={{
                        __html:
                          'به “ تم” خوش آمدید. شما ضمن استفاده از “ تم  “(شامل www.tm-ksa.zoomiroom.com و سایر سایت‏ها، خدمات و ابزارهای مرتبط با آن)، موافقت خود را با شرایط و تعهد به انجام مفاد توافق‏نامه ‏ای که توسط تیم ایده وب تعیین شده، به شرح زیر اعلام کرده‏ اید.\n' +
                          'پیش از اینکه عضو “ تم  “شوید یا از خدمات و ابزار سایت “ تم  “استفاده کنید، لازم است که تمام شرایط و ضوابط مرتبط با این توافق‏نامه کاربری و نیز سیاست حفظ حریم شخصی را به دقت مطالعه و موافقت خود را با آن اعلام کنید. با قبول این توافق‏نامه کاربری، شما پذیرفته ‏اید هر زمان که از سایت‏ها و خدمات “ تم  “، یا از ابزارهایی که در دسترس کابران قرار داده شده تا با آن از خدمات سایت‏های “ تم  “بهره‏ مند شوند، استفاده کنید، مفاد توافق‏نامه کاربری و سیاست حفظ حریم شخصی مصداق یافته و لازم ‏الاجر است.\n' +
                          'استفاده از “ تم  “\n' +
                          'قرارداد و توافق نامه کاربری “ تم  “بر اساس قوانین جمهوری اسلامی ایران تدوین شده است.\n' +
                          'با ارسال یک آگهی در سایت “ تم  “، مسئولیت حقوقی کامل مضمون آن و بررسی صحت و مطابقت آن با قوانین و یا اخلاق حسنه و عرف اسلامی به عهده شما خواهد بود، و در ضمن، شما پیشاپیش موافقت خود را با شرایط عنوان شده در زیر اعلام کرده‏ اید: هنگامی که یک آیتم را در سایت “ تم  “وارد می‏کنید، فهرست‏ های شما به سایت‏ “ تم  “ارسال می‏شود. فهرست شما ممکن است بر اساس حروف کلیدی یا دسته‏ بندی برای چند ساعت قابل جستجو نباشد (یا بعضی مواقع تا 24 ساعت)، بنابراین “ تم  “نمی‏تواند مدت زمان دقیق فهرست‏ بندی را تعیین و تضمین کند. فهرست‏ بندی شما در نتایج جستجو نمایش داده می‏شود و نتایج آن، بستگی به فاکتورهای مشخص شامل فرمت فهرست ‏بندی، عنوان، زمان، کلمات کلیدی، قیمت و غیره دارد.\n' +
                          'تا زمانی که از سایت‏ها، خدمات و ابزارهای “ تم  “استفاده می‏کنید، نمی‏توانید:\n' +
                          'آگهی‏ هایی که مرتبط با\n' +
                          '\tکالا و خدمات غیرمجاز\n' +
                          '\tعدم رعایت قانون، اخلال در حقوق شخص ثالث و یا سیاست‏های “ تم  “\n' +
                          '  و یا مخالف با قوانین موضوعه و یا اخلاق حسنه و عرف اسلام باشد درج کنید.\n' +
                          'موارد ممنوعیت و یا محدودیت استفاده از “ تم  “\n' +
                          'بدون ایجاد محدودیت در روش‏های برخورد در حیطه قانون و اختیارات اداره این سایت، در صورتی که به این نتیجه برسیم که کاربری مشکل ایجاد می‏کند یا الزامات قانونی خود را زیر پا می‏گذارد، به حقوق معنوی و یا قانونی شخص ثالث تجاوز می‏کند، یا نسبت به تعهدات خود و نفس سیاست‏های ما متناقض عمل می‏کند، می‏توانیم خدمات و حساب کاربردی کاربر را محدود کنیم، به تعلیق درآوریم و یا آن را مسدود کنیم، به گونه ‏ای که از دسترسی وی به سایت‏ها و دیگر مضامین، خدمات و ابزارهایمان ممانعت به عمل آورده، به تأخیر بیاندازیم یا مضامین او را حذف کنیم، همچنین به منظور جلوگیری از ورود کاربر به سایت و دور نگه داشتن او از فضای سایت، اقدامات لازم فنی و قانونی انجام می‏شود. به علاوه، ممکن است، در شرایط مناسب و به صلاحدید خودمان، اکانت‏های کاربرانی را که نسبت به حقوق معنوی و قانونی شخص ثالث تخطی کرده و این عمل را تکرار کنند، به حالت تعلیق در آوریم و یا مسدود کنیم. ما همچنین حق لغو کردن اکانت های تأیید نشده یا اکانت هایی که برای مدت طولانی فعال نبودند، بهبود، ویرایش یا توقف فعالیت سایت‏ها، خدمات و ابزارهای “ تم  “را نزد خود محفوظ نگه می‏داریم. لذا ضمن قرارداد حاضر و عقد خارج لازم کاربر به ما وکالت با اسقاط حق عزل اعطاء کرده، تا بنا به تشخیص ما، هر یک از موارد بیان شده در بالا اعمال شود و حق هرگونه اعتراض و ادعایی را از خود سلب کند.\n' +
                          'شما موافقت کرده ‏اید و تعهد داده‏ اید که از روبات، اسپایدر، اسکریپر یا سایر وسایل اتوماتیک جهت دسترسی به سایت به هر دلیلی و یا قصدی بدون دریافت مجوز صریح و کتبی ما استفاده نکنید.\n' +
                          'همچنین شما موافقت کرده و تعهد داده اید تا موارد زیر را انجام ندهید:\n' +
                          '\tهر عملی (به صلاحدید خودمان) که تحمیل کند یا ممکن است بی دلیل، ناخواسته یا بطور نامناسب فشار زیادی را به زیرساختار سازمان ما تحمیل کند.\n' +
                          '\tکپی، خلق مجدد، ویرایش، ساختن کارهای بدلی و نشئت گرفته از آن، توزیع کردن، یا نمایش عمومی هر مضمونی (به جز برای اطلاع شما) از سایت‏ها، بدون اینکه از پیش، مجوز صریح و مکتوب “ تم  “و یا شخص ثالث مربوطه را دریافت کرده باشید\n' +
                          '\tایجاد مزاحمت یا تلاش برای ایجاد مزاحمت در فعالیت سایت‏ها، خدمات یا ابزارها، یا هرگونه فعالیتی که در ارتباط با اداره کردن سایت‏ها، خدمات یا ابزارها باشد\n' +
                          'محدودیت نکات قابل توجه در میزان مسئولیت‏های “ تم  “\n' +
                          '“ تم  “در قبال محتوا، فعالیت‏ها یا عدم فعالیت‏ها، و آگهی‏ هایی که کاربران در سایت قرار داده‏ اند، هیچ مسئولیتی نمی‏پذیرد. شما سایت ما را به عنوان فضایی که به هر کسی این امکان را می‏دهد تا درباره هر چیزی، در هر زمانی، و از هر جایی تبلیغ کند، خواهید شناخت. ما در معاملات واقعی میان خریداران و فروشندگان شرکت نمی‏کنیم. ما هیچ کنترلی روی کالای تبلیغ شده از هیچ نظر، اعم از کیفیت و استاندارد و رعایت قوانین گمرکی و غیره و نیز درستی یا قانونی بودن موارد یا خدماتی که در آگهی به آن‏ها اشاره شده، و واقعیت یا صحت مضامین یا آگهی‏ های کاربران نداشته و مسئولیت بررسی و تحقیق راجع به آن‏ها با خود کاربران است. این سایت صرفاً محلی برای درج آگهی‏ ها است.\n' +
                          'ممکن است لینک‏هایی از طریق سایت‏ “ تم  “به سایت‏ها و یا مضامین و یا فایل‏هایی که در کنترل “ تم  “نیستند، از سوی شخص ثالث در اختیار بینندگان آگهی قرار داده شود. این نوع لینک‏ها صرفاً به منظور معرفی آیتم و به عنوان مرجع در اختیار بینندگان قرار داده شده، و به هیچ وجه به قصد پشتیبانی با صحه گذاشتن بر سایت وابسته یا عملکرد آن نبوده و همچنین حاوی تائیدیه یا ضمانتی مبنی بر صحت اطلاعات عنوان شده در چنین سایت‏هایی نیست. “ تم  “هیچ مسئولیتی در قبال چنین سایت‏ها، فایل‏ها و مضامینی که از طریق لینک‏های قرار داده شده در سایت‏ “ تم  “به آن‏ها دسترسی می یابید، ندارد. به علاوه “ تم  “، به هیچ وجه خدمات یا محصولات ارائه شده در این سایت‏ها یا مضامین چنین خدمات و محصولاتی را که از طریق لینک‏های قرار داده شده در “ تم  “به آن‏ها دسترسی دارید، تضمین نمی‏کند.\n' +
                          'ما نمی‏توانیم دسترسی مطمئن و پیوسته به سایت‏ها، خدمات یا ابزارهای‏مان را ضمانت کنیم؛ چرا که عملکرد سایت‏ها، خدمات یا ابزارهای ما، ممکن است در اثر فاکتورهای بیشماری که خارج از کنترل ما هستند، دچار اختلال شود. بنابراین، تا جایی که قانون مجاز دانسته، ما کلیه ضمانت‏ها، مفاد و شرایط ضمنی را مستثنی کرده‏ایم. ما هیچ مسئولیتی در قبال از بین رفتن پول، ضرر و زیان، حسن نیت یا اعتبار، یا هرگونه خسارت خاص، غیرمستقیم یا ناشی از \n' +
                          ' ناتوانی شما - چه مستقیم باشد یا غیر مستقیم - در استفاده از سایت‏ها، خدمات یا ابزارهایمان نمی‏پذیریم.  \n' +
                          '\n' +
                          '\n' +
                          '\n' +
                          'حریم شخصی\n' +
                          'ما اطلاعات شخصی را بدون کسب موافقت صریح شما، به شخص ثالثی برای به کارگیری در اهداف بازاریابی نمی‏فروشیم یا اجاره نمی‏دهیم. ما از اطلاعات شما فقط مطابق با آنچه که در سیاست حفظ حریم شخصی “ تم  “توضیح داده شده، استفاده می‏کنیم. ما حفاظت از حریم شخصی کاربران را به عنوان یک اصل اجتماعی مهم به حساب می‏ آوریم. اطلاعات شما در رایانه‏ هایی که توسط سیستم‏ های امنیتی فیزیکی و مجهز به تکنولوژی‏های پیشرفته محافظت شده، ذخیره و پردازش می‎شود. به علاوه این رایانه ‏ها در موقعیت‏های گوناگون جغرافیایی واقع شده‏ اند. شما می‏توانید به اطلاعاتی که در اختیار ما قرار داده‏ اید دسترسی داشته و آن‏ها را ویرایش کنید. در صورتی که نسبت به انتقال اطلاعات خود یا استفاده از آنها به ترتیب مذکور معترض هستید یا رضایت ندارید، لطفاً از خدمات ما استفاده نکنید\n' +
                          'عمومی\n' +
                          '“ تم  “و وابستگان، کارمندان، مدیران، شرکاء و توزیع ‏کنندگان رسمی “ تم  “هیچ مسئولیت قانونی و اخلاقی در قبال خدماتی که از طریق سایت‏ “ تم  “توسط اشخاص ثالث ارائه می‏شوند، یا برای فهرست‏ ها و مضامینی که توسط اشخاص ثالث تهیه شده، و آگهی می‏شوند، ندارد و صرفاً در حدود قانون، آگهی‏ های اشخاص ثالث را درج می‏کند.\n' +
                          'اگر هر بندی از این توافق‏نامه، مطابق قانون نامعتبر یا اجرا نشدنی باشد، چنین بندی باید مجدداً بررسی شده و باقی شروط و ضوابط به قوت خود باقی هستند. ما این توافق‏نامه را به صلاحدید خود، طبق بخش اطلاعیه‏ ها ممکن است، تغییر دهیم. بالای صفحه فقط مربوط به اهداف رجوعی است و گستره یا وسعت این قسمت را محدود نمی‏کند. عدم اقدام قانونی ما نسبت به نقض قوانین توسط شما یا سایر افراد به این معنا نیست که ما از حق خود نسبت به برخورد با نقض قوانین گذشته‏ ایم و عمل مغایر با قوانین با برخورد متعاقب مواجه نخواهد شد. در عین حال، ما تضمین نمی‏کنیم در قبال کلیه موارد نقض قوانین توافق نامه، موارد ذکر شده را اجرا کنیم.\n' +
                          'به جز بیانیه ‏های صریحی که به گونه ‏ای دیگر عنوان شدند، اطلاعیه‏ های قانونی باید به نشانی ایمیلی که شما حین ثبت نام وارد کردید، فرستاده شوند. اطلاعیه باید حداکثر ظرف 24 ساعت پس از ارسال ایمیل، دریافت شود، مگر اینکه قسمت ارسال مطلع شود که نشانی ایمیل داده شده، نامعتبر است. در این حالت، ما توسط نشانی ‏ای که هنگام ثبت نام، وارد کرده‏ اید، به شما اخطار قانونی می‏دهیم. در چنین مواردی، به صورت پیش فرض، اخطار باید 3 روز پس از تاریخ ارسال آن، دریافت شده باشد.\n' +
                          'ممکن است در هر زمانی، این توافق نامه تغییر کند یا اصلاح شود که موارد اصلاح شده در “ تم  “اعلام خواهد شد. به غیر از موارد استثنایی، کلیه اصلاح‏ها یا موارد تغییر یافته، از زمان تاریخ انتشار خود لازم الاجرا هستند.\n',
                      }}
                    />
                  </CardBody>
                </Card>
              </Col>
            </Row>
            <Row>
              <Col lg="12" md="12">
                <div className="sfdgf"></div>
              </Col>
            </Row>
          </Col>
        </Row>
      </Container>
    );
  }
}

export default withTranslation()(Post);
